import 'package:flutter/material.dart';
import 'package:gadgets/vivo_phones.dart';

void main() {
  runApp(const MyApp());
}

class MyApp extends StatelessWidget {
  const MyApp({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return MaterialApp(
      debugShowCheckedModeBanner: false,
      title: "FlutterApp",
      theme: ThemeData(primarySwatch: Colors.blueGrey),
      home: vivo_page(),
    );
  }
}

class vivo_page extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
        appBar: AppBar(
          title: Text("Gadegts"),
        ),
        body: SingleChildScrollView(
          child: Container(
            child: Column(
              children: [
                SizedBox(
                  height: 55,
                ),
                Center(
                  child: Text(
                    '𝑽𝒊𝒗𝒐',
                    style: TextStyle(fontSize: 35),
                  ),
                ),
                SizedBox(
                  height: 40,
                ),
                Image.asset(
                  'assets/mobile_img/vivo.webp',
                  height: 150,
                  width: 300,
                ),
                SizedBox(
                  height: 40,
                ),
                Padding(
                  padding: const EdgeInsets.all(10.0),
                  child: Text(
                    '𝑽𝒊𝒗𝒐 𝑪𝒐𝒎𝒎𝒖𝒏𝒊𝒄𝒂𝒕𝒊𝒐𝒏 𝑻𝒆𝒄𝒉𝒏𝒐𝒍𝒐𝒈𝒚 𝑪𝒐. 𝑳𝒕𝒅., (𝒔𝒕𝒚𝒍𝒆𝒅 𝒂𝒔 𝒗𝒊𝒗𝒐), 𝒊𝒔 𝒂 𝑪𝒉𝒊𝒏𝒆𝒔𝒆 𝒎𝒖𝒍𝒕𝒊𝒏𝒂𝒕𝒊𝒐𝒏𝒂𝒍 𝒕𝒆𝒄𝒉𝒏𝒐𝒍𝒐𝒈𝒚 𝒄𝒐𝒎𝒑𝒂𝒏𝒚 𝒉𝒆𝒂𝒅𝒒𝒖𝒂𝒓𝒕𝒆𝒓𝒆𝒅 𝒊𝒏 𝑫𝒐𝒏𝒈𝒈𝒖𝒂𝒏, 𝑮𝒖𝒂𝒏𝒈𝒅𝒐𝒏𝒈 𝒕𝒉𝒂𝒕 𝒅𝒆𝒔𝒊𝒈𝒏𝒔 𝒂𝒏𝒅 𝒅𝒆𝒗𝒆𝒍𝒐𝒑𝒔 𝒔𝒎𝒂𝒓𝒕𝒑𝒉𝒐𝒏𝒆𝒔, 𝒔𝒎𝒂𝒓𝒕𝒑𝒉𝒐𝒏𝒆 𝒂𝒄𝒄𝒆𝒔𝒔𝒐𝒓𝒊𝒆𝒔, 𝒔𝒐𝒇𝒕𝒘𝒂𝒓𝒆 𝒂𝒏𝒅 𝒐𝒏𝒍𝒊𝒏𝒆 𝒔𝒆𝒓𝒗𝒊𝒄𝒆𝒔. 𝑻𝒉𝒆 𝒄𝒐𝒎𝒑𝒂𝒏𝒚 𝒅𝒆𝒗𝒆𝒍𝒐𝒑𝒔 𝒔𝒐𝒇𝒕𝒘𝒂𝒓𝒆 𝒇𝒐𝒓 𝒊𝒕𝒔 𝒑𝒉𝒐𝒏𝒆𝒔, 𝒅𝒊𝒔𝒕𝒓𝒊𝒃𝒖𝒕𝒆𝒅 𝒕𝒉𝒓𝒐𝒖𝒈𝒉 𝒊𝒕𝒔 𝑽-𝑨𝒑𝒑𝒔𝒕𝒐𝒓𝒆, 𝒘𝒊𝒕𝒉 𝒊𝑴𝒂𝒏𝒂𝒈𝒆𝒓 𝒊𝒏𝒄𝒍𝒖𝒅𝒆𝒅 𝒊𝒏 𝒕𝒉𝒆𝒊𝒓 𝒑𝒓𝒐𝒑𝒓𝒊𝒆𝒕𝒂𝒓𝒚, 𝑨𝒏𝒅𝒓𝒐𝒊𝒅-𝒃𝒂𝒔𝒆𝒅 𝒐𝒑𝒆𝒓𝒂𝒕𝒊𝒏𝒈 𝒔𝒚𝒔𝒕𝒆𝒎, 𝑶𝒓𝒊𝒈𝒊𝒏 𝑶𝑺 𝒊𝒏 𝑴𝒂𝒊𝒏𝒍𝒂𝒏𝒅 𝑪𝒉𝒊𝒏𝒂 𝒂𝒏𝒅 𝑰𝒏𝒅𝒊𝒂, 𝒂𝒏𝒅 𝑭𝒖𝒏𝒕𝒐𝒖𝒄𝒉 𝑶𝑺 𝒆𝒍𝒔𝒆𝒘𝒉𝒆𝒓𝒆. 𝑽𝒊𝒗𝒐 𝒊𝒔 𝒂𝒏 𝒊𝒏𝒅𝒆𝒑𝒆𝒏𝒅𝒆𝒏𝒕 𝒄𝒐𝒎𝒑𝒂𝒏𝒚 𝒂𝒏𝒅 𝒅𝒆𝒗𝒆𝒍𝒐𝒑𝒔 𝒊𝒕𝒔 𝒐𝒘𝒏 𝒑𝒓𝒐𝒅𝒖𝒄𝒕𝒔. 𝑰𝒕 𝒉𝒂𝒔 10,000 𝒆𝒎𝒑𝒍𝒐𝒚𝒆𝒆𝒔, 𝒘𝒊𝒕𝒉 𝒓𝒆𝒔𝒆𝒂𝒓𝒄𝒉 𝒂𝒏𝒅 𝒅𝒆𝒗𝒆𝒍𝒐𝒑𝒎𝒆𝒏𝒕 𝒄𝒆𝒏𝒕𝒆𝒓𝒔 𝒊𝒏 𝑺𝒉𝒆𝒏𝒛𝒉𝒆𝒏, 𝑮𝒖𝒂𝒏𝒈𝒅𝒐𝒏𝒈, 𝒂𝒏𝒅 𝑵𝒂𝒏𝒋𝒊𝒏𝒈, 𝑱𝒊𝒂𝒏𝒈𝒔𝒖.[3] v𝑰𝒏 𝒕𝒉𝒆 𝒇𝒊𝒓𝒔𝒕 𝒒𝒖𝒂𝒓𝒕𝒆𝒓 𝒐𝒇 2015, 𝑽𝒊𝒗𝒐 𝒘𝒂𝒔 𝒓𝒂𝒏𝒌𝒆𝒅 𝒂𝒎𝒐𝒏𝒈 𝒕𝒉𝒆 𝒕𝒐𝒑 10 𝒔𝒎𝒂𝒓𝒕𝒑𝒉𝒐𝒏𝒆 𝒎𝒂𝒌𝒆𝒓𝒔, 𝒂𝒄𝒉𝒊𝒆𝒗𝒊𝒏𝒈 𝒂 𝒈𝒍𝒐𝒃𝒂𝒍 𝒎𝒂𝒓𝒌𝒆𝒕 𝒔𝒉𝒂𝒓𝒆 𝒐𝒇 2.7%.[4]  𝑺𝒊𝒏𝒄𝒆 𝒊𝒕𝒔 𝒇𝒐𝒖𝒏𝒅𝒊𝒏𝒈 𝒊𝒏 2009, 𝑽𝒊𝒗𝒐 𝒉𝒂𝒔 𝒆𝒙𝒑𝒂𝒏𝒅𝒆𝒅 𝒕𝒐 𝒐𝒗𝒆𝒓 100 𝒄𝒐𝒖𝒏𝒕𝒓𝒊𝒆𝒔 𝒂𝒓𝒐𝒖𝒏𝒅 𝒕𝒉𝒆 𝒘𝒐𝒓𝒍𝒅. 𝑰𝒏𝒕𝒆𝒓𝒏𝒂𝒕𝒊𝒐𝒏𝒂𝒍 𝒆𝒙𝒑𝒂𝒏𝒔𝒊𝒐𝒏 𝒃𝒆𝒈𝒂𝒏 𝒊𝒏 2014, 𝒘𝒉𝒆𝒏 𝒕𝒉𝒆 𝒄𝒐𝒎𝒑𝒂𝒏𝒚 𝒆𝒏𝒕𝒆𝒓𝒆𝒅 𝒕𝒉𝒆 𝑻𝒉𝒂𝒊𝒍𝒂𝒏𝒅 𝒎𝒂𝒓𝒌𝒆𝒕.[5] 𝑽𝒊𝒗𝒐 𝒒𝒖𝒊𝒄𝒌𝒍𝒚 𝒇𝒐𝒍𝒍𝒐𝒘𝒆𝒅 𝒖𝒑 𝒘𝒊𝒕𝒉 𝒍𝒂𝒖𝒏𝒄𝒉𝒆𝒔 𝒊𝒏 𝑰𝒏𝒅𝒊𝒂, 𝑰𝒏𝒅𝒐𝒏𝒆𝒔𝒊𝒂, 𝑴𝒂𝒍𝒂𝒚𝒔𝒊𝒂, 𝑴𝒚𝒂𝒏𝒎𝒂𝒓, 𝑷𝒉𝒊𝒍𝒊𝒑𝒑𝒊𝒏𝒆𝒔, 𝑻𝒉𝒂𝒊𝒍𝒂𝒏𝒅, 𝒂𝒏𝒅 𝑽𝒊𝒆𝒕𝒏𝒂𝒎.  𝑰𝒏 2017, 𝑽𝒊𝒗𝒐 𝒆𝒏𝒕𝒆𝒓𝒆𝒅 𝒕𝒉𝒆 𝒔𝒎𝒂𝒓𝒕𝒑𝒉𝒐𝒏𝒆 𝒎𝒂𝒓𝒌𝒆𝒕 𝒊𝒏 𝑹𝒖𝒔𝒔𝒊𝒂, 𝑺𝒓𝒊 𝑳𝒂𝒏𝒌𝒂, 𝑻𝒂𝒊𝒘𝒂𝒏, 𝑯𝒐𝒏𝒈 𝑲𝒐𝒏𝒈, 𝑩𝒓𝒖𝒏𝒆𝒊, 𝑴𝒂𝒄𝒂𝒖, 𝑪𝒂𝒎𝒃𝒐𝒅𝒊𝒂, 𝑳𝒂𝒐𝒔, 𝑩𝒂𝒏𝒈𝒍𝒂𝒅𝒆𝒔𝒉, 𝒂𝒏𝒅 𝑵𝒆𝒑𝒂𝒍.[6][7][8][9] 𝑰𝒏 𝑱𝒖𝒏𝒆 2017, 𝒊𝒕 𝒆𝒏𝒕𝒆𝒓𝒆𝒅 𝒕𝒉𝒆 𝑷𝒂𝒌𝒊𝒔𝒕𝒂𝒏 𝒔𝒎𝒂𝒓𝒕𝒑𝒉𝒐𝒏𝒆 𝒎𝒂𝒓𝒌𝒆𝒕 𝒂𝒏𝒅 𝒕𝒉𝒆 𝑽𝒊𝒗𝒐 𝒃𝒓𝒂𝒏𝒅 𝒊𝒔 𝒄𝒖𝒓𝒓𝒆𝒏𝒕𝒍𝒚 𝒆𝒙𝒑𝒆𝒓𝒊𝒆𝒏𝒄𝒊𝒏𝒈 𝒓𝒂𝒑𝒊𝒅 𝒈𝒓𝒐𝒘𝒕𝒉 𝒂𝒏𝒅 𝒑𝒐𝒑𝒖𝒍𝒂𝒓𝒊𝒕𝒚 𝒊𝒏 𝒕𝒉𝒆 𝒄𝒐𝒖𝒏𝒕𝒓𝒚.[10][11]  𝑰𝒏 𝑶𝒄𝒕𝒐𝒃𝒆𝒓 2020, 𝑽𝒊𝒗𝒐 𝒂𝒏𝒏𝒐𝒖𝒏𝒄𝒆𝒅 𝒕𝒉𝒂𝒕 𝒊𝒕 𝒘𝒐𝒖𝒍𝒅 𝒃𝒆𝒈𝒊𝒏 𝒕𝒐 𝒔𝒆𝒍𝒍 𝒊𝒕𝒔 𝒑𝒓𝒐𝒅𝒖𝒄𝒕𝒔 𝒂𝒍𝒔𝒐 𝒊𝒏 𝑬𝒖𝒓𝒐𝒑𝒆.[3]   𝑽𝒊𝒗𝒐 𝑿60 𝒇𝒆𝒂𝒕𝒖𝒓𝒆𝒅 𝒕𝒉𝒆 𝒁𝒆𝒊𝒔𝒔 𝒄𝒐-𝒆𝒏𝒈𝒊𝒏𝒆𝒆𝒓𝒆𝒅 𝒊𝒎𝒂𝒈𝒊𝒏𝒈 𝒔𝒚𝒔𝒕𝒆𝒎 𝑶𝒏 17 𝑫𝒆𝒄𝒆𝒎𝒃𝒆𝒓 2020, 𝑽𝒊𝒗𝒐 𝒂𝒏𝒅 𝒁𝒆𝒊𝒔𝒔 𝒂𝒏𝒏𝒐𝒖𝒏𝒄𝒆𝒅 𝒂 𝒍𝒐𝒏𝒈-𝒕𝒆𝒓𝒎 𝒔𝒕𝒓𝒂𝒕𝒆𝒈𝒊𝒄 𝒑𝒂𝒓𝒕𝒏𝒆𝒓𝒔𝒉𝒊𝒑 𝒕𝒐 𝒋𝒐𝒊𝒏𝒕𝒍𝒚 𝒑𝒓𝒐𝒎𝒐𝒕𝒆 𝒂𝒏𝒅 𝒅𝒆𝒗𝒆𝒍𝒐𝒑 𝒃𝒓𝒆𝒂𝒌𝒕𝒉𝒓𝒐𝒖𝒈𝒉 𝒊𝒏𝒏𝒐𝒗𝒂𝒕𝒊𝒐𝒏𝒔 𝒊𝒏 𝒎𝒐𝒃𝒊𝒍𝒆 𝒊𝒎𝒂𝒈𝒊𝒏𝒈 𝒕𝒆𝒄𝒉𝒏𝒐𝒍𝒐𝒈𝒚. 𝑻𝒉𝒆 𝒇𝒊𝒓𝒔𝒕 “𝑽𝒊𝒗𝒐 𝒁𝒆𝒊𝒔𝒔 𝒄𝒐-𝒆𝒏𝒈𝒊𝒏𝒆𝒆𝒓𝒆𝒅 𝒊𝒎𝒂𝒈𝒊𝒏𝒈 𝒔𝒚𝒔𝒕𝒆𝒎” 𝒘𝒊𝒍𝒍 𝒃𝒆 𝒇𝒆𝒂𝒕𝒖𝒓𝒆𝒅 𝒊𝒏 𝒕𝒉𝒆 𝑽𝒊𝒗𝒐 𝑿60 𝒔𝒆𝒓𝒊𝒆𝒔. 𝑨𝒔 𝒑𝒂𝒓𝒕 𝒐𝒇 𝒕𝒉𝒆 𝒄𝒐𝒍𝒍𝒂𝒃𝒐𝒓𝒂𝒕𝒊𝒐𝒏 𝒂𝒈𝒓𝒆𝒆𝒎𝒆𝒏𝒕, 𝑽𝒊𝒗𝒐 𝒂𝒏𝒅 𝒁𝒆𝒊𝒔𝒔 𝒘𝒊𝒍𝒍 𝒆𝒔𝒕𝒂𝒃𝒍𝒊𝒔𝒉 𝒕𝒉𝒆 𝑽𝒊𝒗𝒐 𝒁𝒆𝒊𝒔𝒔 𝑰𝒎𝒂𝒈𝒊𝒏𝒈 𝑳𝒂𝒃, 𝒂 𝒋𝒐𝒊𝒏𝒕 𝑹&𝑫 𝒑𝒓𝒐𝒈𝒓𝒂𝒎 𝒕𝒐 𝒊𝒏𝒏𝒐𝒗𝒂𝒕𝒆 𝒎𝒐𝒃𝒊𝒍𝒆 𝒊𝒎𝒂𝒈𝒊𝒏𝒈 𝒕𝒆𝒄𝒉𝒏𝒐𝒍𝒐𝒈𝒚 𝒇𝒐𝒓 𝑽𝒊𝒗𝒐𝒔 𝒇𝒍𝒂𝒈𝒔𝒉𝒊𝒑 𝒔𝒎𝒂𝒓𝒕𝒑𝒉𝒐𝒏𝒆𝒔. [12]  𝑰𝒏 𝑨𝒑𝒓𝒊𝒍 2021, 𝒕𝒉𝒓𝒆𝒆 𝒑𝒂𝒍𝒍𝒆𝒕𝒔 𝒐𝒇 𝑽𝒊𝒗𝒐 𝒑𝒉𝒐𝒏𝒆𝒔 𝒄𝒂𝒖𝒈𝒉𝒕 𝒇𝒊𝒓𝒆 𝒂𝒕 𝑯𝒐𝒏𝒈 𝑲𝒐𝒏𝒈 𝑰𝒏𝒕𝒆𝒓𝒏𝒂𝒕𝒊𝒐𝒏𝒂𝒍 𝑨𝒊𝒓𝒑𝒐𝒓𝒕, 𝒑𝒓𝒐𝒎𝒑𝒕𝒊𝒏𝒈 𝒂 𝒃𝒂𝒏 𝒐𝒏 𝒂𝒊𝒓 𝒇𝒓𝒆𝒊𝒈𝒉𝒕 𝒐𝒇 𝑽𝒊𝒗𝒐 𝒑𝒉𝒐𝒏𝒆𝒔 𝒕𝒉𝒓𝒐𝒖𝒈𝒉 𝑯𝒐𝒏𝒈 𝑲𝒐𝒏𝒈.[13]  𝑰𝒏 𝑱𝒖𝒏𝒆 2022, 𝑽𝒊𝒗𝒐 𝒆𝒏𝒕𝒆𝒓𝒆𝒅 𝒕𝒉𝒆 𝒘𝒐𝒓𝒍𝒅 𝒇𝒂𝒎𝒐𝒖𝒔 𝑮𝒖𝒊𝒏𝒏𝒆𝒔𝒔 𝑩𝒐𝒐𝒌 𝒐𝒇 𝑹𝒆𝒄𝒐𝒓𝒅𝒔.[14] 𝑰𝒕 𝒂𝒄𝒉𝒊𝒆𝒗𝒆𝒅 𝒕𝒉𝒆 𝒓𝒆𝒄𝒐𝒓𝒅 𝒇𝒐𝒓 𝒕𝒉𝒆 "𝑳𝒐𝒏𝒈𝒆𝒔𝒕 𝑽𝒊𝒅𝒆𝒐" 𝒊𝒏 𝒘𝒉𝒊𝒄𝒉 𝒊𝒕𝒔 𝒇𝒍𝒂𝒈𝒔𝒉𝒊𝒑 𝒅𝒆𝒗𝒊𝒄𝒆 𝑽𝒊𝒗𝒐 𝑿 𝑭𝒐𝒍𝒅 𝒉𝒂𝒑𝒑𝒆𝒏𝒆𝒅 𝒕𝒐 𝒃𝒆 𝒇𝒐𝒍𝒅𝒆𝒅 𝒐𝒗𝒆𝒓 300,000 𝒕𝒊𝒎𝒆𝒔 𝒇𝒐𝒓 𝒂 𝒕𝒐𝒕𝒂𝒍 𝒍𝒆𝒏𝒈𝒕𝒉 𝒐𝒇 270 𝒉𝒐𝒖𝒓𝒔 𝒐𝒓 11 𝒅𝒂𝒚𝒔 𝒂𝒏𝒅 6 𝒉𝒐𝒖𝒓𝒔.[15]',
                    style: TextStyle(fontSize: 15),
                  ),
                ),
                SizedBox(
                  height: 40,
                ),
                Text(
                  'Click Here To See Best Phones From VIVO',
                  style: TextStyle(fontSize: 15, fontWeight: FontWeight.bold),
                ),
                SizedBox(
                  height: 20,
                ),
                Icon(
                  Icons.arrow_downward_outlined,
                  size: 30,
                ),
                SizedBox(
                  height: 20,
                ),
                SizedBox(
                    child: ElevatedButton(
                        onPressed: () {
                          Navigator.push(
                              context,
                              MaterialPageRoute(
                                builder: (context) => vivo_phones(),
                              ));
                        },
                        child: Text(
                          'Click Here',
                          style: TextStyle(fontSize: 20),
                        )))
              ],
            ),
          ),
        ));
  }
}
